Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_DA_DFP/0.1/PIC32MZDA/atdf/PIC32MZ1025DAL176.atdf
      <value-group caption="Interrupt Proximity Timer Control bits" name="INTCON__TPC">
         <value caption="Interrupts of group priority 7 or lower start the Interrupt Proximity timer" name="" value="0x7" />
         <value caption="Interrupts of group priority 6 or lower start the Interrupt Proximity timer" name="" value="0x6" />
         <value caption="Interrupts of group priority 5 or lower start the Interrupt Proximity timer" name="" value="0x5" />
         <value caption="Interrupts of group priority 4 or lower start the Interrupt Proximity timer" name="" value="0x4" />
         <value caption="Interrupts of group priority 3 or lower start the Interrupt Proximity timer" name="" value="0x3" />
         <value caption="Interrupts of group priority 2 or lower start the Interrupt Proximity timer" name="" value="0x2" />
         <value caption="Interrupts of group priority 1 start the Interrupt Proximity timer" name="" value="0x1" />
         <value caption="Disables Interrupt Proximity timer" name="" value="0x0" />
      </value-group>
      <value-group caption="Multi Vector Configuration bit" name="INTCON__MVEC">
         <value caption="Interrupt controller configured for multi-vectored mode" name="" value="0x1" />
         <value caption="Interrupt controller configured for single vectored mode" name="" value="0x0" />
      </value-group>
      <value-group caption="Single Vector Shadow Register Set bit" name="PRISS__SS0">
         <value caption="Single vector is presented with a shadow set" name="" value="0x1" />
         <value caption="Single vector is not presented with a shadow set" name="" value="0x0" />
      </value-group>
      <value-group caption="Interrupt with Priority Level 1 Shadow Set bits (1)" name="PRISS__PRI1SS">
         <value caption="Reserved (by default, an interrupt with a priority level of 1 uses Shadow Set 0)" name="" value="0xf" />
         <value caption="Reserved (by default, an interrupt with a priority level of 1 uses Shadow Set 0)" name="" value="0xe" />
         <value caption="Reserved (by default, an interrupt with a priority level of 1 uses Shadow Set 0)" name="" value="0xd" />
         <value caption="Reserved (by default, an interrupt with a priority level of 1 uses Shadow Set 0)" name="" value="0xc" />
         <value caption="Reserved (by default, an interrupt with a priority level of 1 uses Shadow Set 0)" name="" value="0xb" />
         <value caption="Reserved (by default, an interrupt with a priority level of 1 uses Shadow Set 0)" name="" value="0xa" />
         <value caption="Reserved (by default, an interrupt with a priority level of 1 uses Shadow Set 0)" name="" value="0x9" />
         <value caption="Reserved (by default, an interrupt with a priority level of 1 uses Shadow Set 0)" name="" value="0x8" />
         <value caption="Interrupt with a priority level of 1 uses Shadow Set 7" name="" value="0x7" />
         <value caption="Interrupt with a priority level of 1 uses Shadow Set 6" name="" value="0x6" />
         <value caption="Interrupt with a priority level of 1 uses Shadow Set 1" name="" value="0x1" />
         <value caption="Interrupt with a priority level of 1 uses Shadow Set 0" name="" value="0x0" />
      </value-group>
      <value-group caption="Interrupt with Priority Level 2 Shadow Set bits (1)" name="PRISS__PRI2SS">
         <value caption="Reserved (by default, an interrupt with a priority level of 2 uses Shadow Set 0)" name="" value="0xf" />
         <value caption="Reserved (by default, an interrupt with a priority level of 2 uses Shadow Set 0)" name="" value="0xe" />
         <value caption="Reserved (by default, an interrupt with a priority level of 2 uses Shadow Set 0)" name="" value="0xd" />
         <value caption="Reserved (by default, an interrupt with a priority level of 2 uses Shadow Set 0)" name="" value="0xc" />
         <value caption="Reserved (by default, an interrupt with a priority level of 2 uses Shadow Set 0)" name="" value="0xb" />
         <value caption="Reserved (by default, an interrupt with a priority level of 2 uses Shadow Set 0)" name="" value="0xa" />
         <value caption="Reserved (by default, an interrupt with a priority level of 2 uses Shadow Set 0)" name="" value="0x9" />
         <value caption="Reserved (by default, an interrupt with a priority level of 2 uses Shadow Set 0)" name="" value="0x8" />
         <value caption="Interrupt with a priority level of 2 uses Shadow Set 7" name="" value="0x7" />
         <value caption="Interrupt with a priority level of 2 uses Shadow Set 6" name="" value="0x6" />
         <value caption="Interrupt with a priority level of 2 uses Shadow Set 1" name="" value="0x1" />
         <value caption="Interrupt with a priority level of 2 uses Shadow Set 0" name="" value="0x0" />
      </value-group>
      <value-group caption="Interrupt with Priority Level 3 Shadow Set bits (1)" name="PRISS__PRI3SS">
         <value caption="Reserved (by default, an interrupt with a priority level of 3 uses Shadow Set 0)" name="" value="0xf" />
         <value caption="Reserved (by default, an interrupt with a priority level of 3 uses Shadow Set 0)" name="" value="0xe" />
         <value caption="Reserved (by default, an interrupt with a priority level of 3 uses Shadow Set 0)" name="" value="0xd" />
         <value caption="Reserved (by default, an interrupt with a priority level of 3 uses Shadow Set 0)" name="" value="0xc" />
         <value caption="Reserved (by default, an interrupt with a priority level of 3 uses Shadow Set 0)" name="" value="0xb" />
         <value caption="Reserved (by default, an interrupt with a priority level of 3 uses Shadow Set 0)" name="" value="0xa" />
         <value caption="Reserved (by default, an interrupt with a priority level of 3 uses Shadow Set 0)" name="" value="0x9" />
         <value caption="Reserved (by default, an interrupt with a priority level of 3 uses Shadow Set 0)" name="" value="0x8" />
         <value caption="Interrupt with a priority level of 3 uses Shadow Set 7" name="" value="0x7" />
         <value caption="Interrupt with a priority level of 3 uses Shadow Set 6" name="" value="0x6" />
         <value caption="Interrupt with a priority level of 3 uses Shadow Set 1" name="" value="0x1" />
         <value caption="Interrupt with a priority level of 3 uses Shadow Set 0" name="" value="0x0" />
      </value-group>
      <value-group caption="Interrupt with Priority Level 4 Shadow Set bits (1)" name="PRISS__PRI4SS">
         <value caption="Reserved (by default, an interrupt with a priority level of 4 uses Shadow Set 0)" name="" value="0xf" />
         <value caption="Reserved (by default, an interrupt with a priority level of 4 uses Shadow Set 0)" name="" value="0xe" />
         <value caption="Reserved (by default, an interrupt with a priority level of 4 uses Shadow Set 0)" name="" value="0xd" />
         <value caption="Reserved (by default, an interrupt with a priority level of 4 uses Shadow Set 0)" name="" value="0xc" />
         <value caption="Reserved (by default, an interrupt with a priority level of 4 uses Shadow Set 0)" name="" value="0xb" />
         <value caption="Reserved (by default, an interrupt with a priority level of 4 uses Shadow Set 0)" name="" value="0xa" />
         <value caption="Reserved (by default, an interrupt with a priority level of 4 uses Shadow Set 0)" name="" value="0x9" />
         <value caption="Reserved (by default, an interrupt with a priority level of 4 uses Shadow Set 0)" name="" value="0x8" />
         <value caption="Interrupt with a priority level of 4 uses Shadow Set 7" name="" value="0x7" />
         <value caption="Interrupt with a priority level of 4 uses Shadow Set 6" name="" value="0x6" />
         <value caption="Interrupt with a priority level of 4 uses Shadow Set 1" name="" value="0x1" />
         <value caption="Interrupt with a priority level of 4 uses Shadow Set 0" name="" value="0x0" />
      </value-group>
