Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_DA_DFP/0.1/PIC32MZDA/atdf/PIC32MZ1025DAL176.atdf
      <value-group caption="Flash Initialization 2 Command Type bits" name="SQI1XCON4__INIT2TYPE">
         <value caption="Reserved" name="" value="0x3" />
         <value caption="INIT2 commands are sent in Quad Lane mode" name="" value="0x2" />
         <value caption="INIT2 commands are sent in Dual Lane mode" name="" value="0x1" />
         <value caption="INIT2 commands are sent in Single Lane mode" name="" value="0x0" />
      </value-group>
      <value-group caption="Flash Initialization 2 Command Count bits" name="SQI1XCON4__INIT2COUNT">
         <value caption="INIT2CMD1, INIT2CMD2, and INIT2CMD3 are sent" name="" value="0x3" />
         <value caption="INIT2CMD1 and INIT2CMD2 are sent, but INIT2CMD3 is still pending" name="" value="0x2" />
         <value caption="INIT2CMD1 is sent, but INIT2CMD2 and INIT2CMD3 are still pending" name="" value="0x1" />
         <value caption="No commands are sent" name="" value="0x0" />
      </value-group>
      <value-group caption="Flash Initialization 2 Command Status Check bit" name="SQI1XCON4__INIT2SCHECK">
         <value caption="Check the status after executing the INIT2 command" name="" value="0x1" />
         <value caption="Do not check the status" name="" value="0x0" />
      </value-group>
   </module>
   <module caption="" id="02141" name="TMR1" version="2">
      <register-group name="TMR1">
         <register caption="TYPE A TIMER CONTROL REGISTER" name="T1CON" offset="0x0" rw="RW" size="4">
            <bitfield caption="Timer Clock Source Select bit" mask="0x00000002" name="TCS" values="T1CON__TCS" />
            <bitfield caption="Timer External Clock Input Synchronization Selection bit" mask="0x00000004" name="TSYNC" values="T1CON__TSYNC" />
            <bitfield caption="Timer Input Clock Prescale Select bits" mask="0x00000030" name="TCKPS" values="T1CON__TCKPS" />
            <bitfield caption="Timer Gated Time Accumulation Enable bit" mask="0x00000080" name="TGATE" values="T1CON__TGATE" />
            <bitfield caption="Timer1 External Clock Selection bits" mask="0x00000300" name="TECS" values="T1CON__TECS" />
            <bitfield caption="Asynchronous Timer Write in Progress bit" mask="0x00000800" name="TWIP" values="T1CON__TWIP" />
            <bitfield caption="Asynchronous Timer Write Disable bit" mask="0x00001000" name="TWDIS" values="T1CON__TWDIS" />
            <bitfield caption="Stop in Idle Mode bit" mask="0x00002000" name="SIDL" values="T1CON__SIDL" />
            <bitfield caption="Timer On bit" mask="0x00008000" name="ON" values="T1CON__ON" />
         </register>
         <register caption="Timer Count Register Bits" name="TMR1" offset="0x10" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="TMR1" />
         </register>
         <register caption="Period Register Bits" name="PR1" offset="0x20" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="PR1" />
         </register>
      </register-group>
      <value-group caption="Timer Clock Source Select bit" name="T1CON__TCS">
         <value caption="External clock is defined by the TECS bits" name="" value="0x1" />
         <value caption="Internal peripheral clock" name="" value="0x0" />
      </value-group>
      <value-group caption="Timer External Clock Input Synchronization Selection bit" name="T1CON__TSYNC">
         <value caption="(When TCS is 1) External clock input is synchronized / (When TCS is 0) This bit is ignored" name="" value="0x1" />
         <value caption="(When TCS is 1) External clock input is not synchronized / (When TCS is 0) This bit is ignored" name="" value="0x0" />
      </value-group>
      <value-group caption="Timer Input Clock Prescale Select bits" name="T1CON__TCKPS">
         <value caption="1:256 prescale value" name="" value="0x3" />
         <value caption="1:64 prescale value" name="" value="0x2" />
         <value caption="1:8 prescale value" name="" value="0x1" />
         <value caption="1:1 prescale value" name="" value="0x0" />
      </value-group>
      <value-group caption="Timer Gated Time Accumulation Enable bit" name="T1CON__TGATE">
         <value caption="(When TCS is 0) Gated time accumulation is enabled / (When TCS is 1) bit is ignored" name="" value="0x1" />
         <value caption="(When TCS is 0) Gated time accumulation is disabled / (When TCS is 1) bit is ignored" name="" value="0x0" />
      </value-group>
      <value-group caption="Timer1 External Clock Selection bits" name="T1CON__TECS">
         <value caption="Reserved" name="" value="0x3" />
         <value caption="External clock comes from the LPRC" name="" value="0x2" />
         <value caption="External clock comes from the T1CK pin" name="" value="0x1" />
         <value caption="External clock comes from the SOSC" name="" value="0x0" />
      </value-group>
      <value-group caption="Asynchronous Timer Write in Progress bit" name="T1CON__TWIP">
         <value caption="(In Asynchronous Timer mode) Asynchronous write to TMR1 register in progress / (In Synchronous Timer mode)bit is read as 0" name="" value="0x1" />
         <value caption="In Asynchronous Timer mode Asynchronous write to TMR1 register complete / (In Synchronous Timer mode)bit is read as 0" name="" value="0x0" />
      </value-group>
      <value-group caption="Asynchronous Timer Write Disable bit" name="T1CON__TWDIS">
         <value caption="Writes to TMR1 are ignored until pending write operation completes" name="" value="0x1" />
         <value caption="Back-to-back writes are enabled (Legacy Asynchronous Timer functionality)" name="" value="0x0" />
      </value-group>
      <value-group caption="Stop in Idle Mode bit" name="T1CON__SIDL">
         <value caption="Discontinue operation when device enters Idle mode" name="" value="0x1" />
         <value caption="Continue operation even in Idle mode" name="" value="0x0" />
      </value-group>
      <value-group caption="Timer On bit" name="T1CON__ON">
         <value caption="Timer is enabled" name="" value="0x1" />
         <value caption="Timer is disabled" name="" value="0x0" />
      </value-group>
   </module>
   <module caption="" id="00745" name="TMR" version="1">
      <register-group name="TMR">
         <register caption="Type B Timer Control Register" name="T2CON" offset="0x0" rw="RW" size="4">
            <bitfield caption="Timer Clock Source Select bit" mask="0x00000002" name="TCS" values="T2CON__TCS" />
            <bitfield caption="32-Bit Timer Mode Select bit" mask="0x00000008" name="T32" values="T2CON__T32" />
            <bitfield caption="Timer Input Clock Prescale Select bits" mask="0x00000070" name="TCKPS" values="T2CON__TCKPS" />
            <bitfield caption="Timer Gated Time Accumulation Enable bit" mask="0x00000080" name="TGATE" values="T2CON__TGATE" />
            <bitfield caption="Stop in Idle Mode bit" mask="0x00002000" name="SIDL" values="T2CON__SIDL" />
            <bitfield caption="Timer On bit" mask="0x00008000" name="ON" values="T2CON__ON" />
         </register>
         <register caption="Type B Timer Control Register" name="T3CON" offset="0x200" rw="RW" size="4">
            <bitfield caption="Timer Clock Source Select bit" mask="0x00000002" name="TCS" values="T3CON__TCS" />
            <bitfield caption="32-Bit Timer Mode Select bit" mask="0x00000008" name="T32" values="T3CON__T32" />
            <bitfield caption="Timer Input Clock Prescale Select bits" mask="0x00000070" name="TCKPS" values="T3CON__TCKPS" />
            <bitfield caption="Timer Gated Time Accumulation Enable bit" mask="0x00000080" name="TGATE" values="T3CON__TGATE" />
            <bitfield caption="Stop in Idle Mode bit" mask="0x00002000" name="SIDL" values="T3CON__SIDL" />
            <bitfield caption="Timer On bit" mask="0x00008000" name="ON" values="T3CON__ON" />
         </register>
         <register caption="Type B Timer Control Register" name="T4CON" offset="0x400" rw="RW" size="4">
            <bitfield caption="Timer Clock Source Select bit" mask="0x00000002" name="TCS" values="T4CON__TCS" />
            <bitfield caption="32-Bit Timer Mode Select bit" mask="0x00000008" name="T32" values="T4CON__T32" />
            <bitfield caption="Timer Input Clock Prescale Select bits" mask="0x00000070" name="TCKPS" values="T4CON__TCKPS" />
            <bitfield caption="Timer Gated Time Accumulation Enable bit" mask="0x00000080" name="TGATE" values="T4CON__TGATE" />
            <bitfield caption="Stop in Idle Mode bit" mask="0x00002000" name="SIDL" values="T4CON__SIDL" />
            <bitfield caption="Timer On bit" mask="0x00008000" name="ON" values="T4CON__ON" />
         </register>
