Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_DA_DFP/0.1/PIC32MZDA/atdf/PIC32MZ1025DAL176.atdf
         <register caption="USB DMA Channel 1 Control Register" name="USBDMA1C" offset="0x204" rw="RW" size="4">
            <bitfield caption="DMA Enable bit" mask="0x00000001" name="DMAEN" values="USBDMA1C__DMAEN" />
            <bitfield caption="DMA Transfer Direction bit" mask="0x00000002" name="DMADIR" values="USBDMA1C__DMADIR" />
            <bitfield caption="DMA Transfer Mode bit" mask="0x00000004" name="DMAMODE" values="USBDMA1C__DMAMODE" />
            <bitfield caption="DMA Interrupt Enable bit" mask="0x00000008" name="DMAIE" values="USBDMA1C__DMAIE" />
            <bitfield mask="0x000000F0" name="DMAEP" />
            <bitfield caption="Bus Error bit" mask="0x00000100" name="DMAERR" values="USBDMA1C__DMAERR" />
            <bitfield caption="DMA Burst Mode Selection bit" mask="0x00000600" name="DMABRSTM" values="USBDMA1C__DMABRSTM" />
         </register>
         <register caption="USB DMA Channel 1 Memory Address Register" name="USBDMA1A" offset="0x208" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DMAADDR" />
         </register>
         <register caption="USB DMA Channel 1 Count Register" name="USBDMA1N" offset="0x20c" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DMACOUNT" />
         </register>
         <register caption="USB DMA Channel 2 Control Register" name="USBDMA2C" offset="0x214" rw="RW" size="4">
            <bitfield caption="DMA Enable bit" mask="0x00000001" name="DMAEN" values="USBDMA2C__DMAEN" />
            <bitfield caption="DMA Transfer Direction bit" mask="0x00000002" name="DMADIR" values="USBDMA2C__DMADIR" />
            <bitfield caption="DMA Transfer Mode bit" mask="0x00000004" name="DMAMODE" values="USBDMA2C__DMAMODE" />
            <bitfield caption="DMA Interrupt Enable bit" mask="0x00000008" name="DMAIE" values="USBDMA2C__DMAIE" />
            <bitfield mask="0x000000F0" name="DMAEP" />
            <bitfield caption="Bus Error bit" mask="0x00000100" name="DMAERR" values="USBDMA2C__DMAERR" />
            <bitfield caption="DMA Burst Mode Selection bit" mask="0x00000600" name="DMABRSTM" values="USBDMA2C__DMABRSTM" />
         </register>
         <register caption="USB DMA Channel 2 Memory Address Register" name="USBDMA2A" offset="0x218" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DMAADDR" />
         </register>
         <register caption="USB DMA Channel 2 Count Register" name="USBDMA2N" offset="0x21c" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DMACOUNT" />
         </register>
         <register caption="USB DMA Channel 3 Control Register" name="USBDMA3C" offset="0x224" rw="RW" size="4">
            <bitfield caption="DMA Enable bit" mask="0x00000001" name="DMAEN" values="USBDMA3C__DMAEN" />
            <bitfield caption="DMA Transfer Direction bit" mask="0x00000002" name="DMADIR" values="USBDMA3C__DMADIR" />
            <bitfield caption="DMA Transfer Mode bit" mask="0x00000004" name="DMAMODE" values="USBDMA3C__DMAMODE" />
            <bitfield caption="DMA Interrupt Enable bit" mask="0x00000008" name="DMAIE" values="USBDMA3C__DMAIE" />
            <bitfield mask="0x000000F0" name="DMAEP" />
            <bitfield caption="Bus Error bit" mask="0x00000100" name="DMAERR" values="USBDMA3C__DMAERR" />
            <bitfield caption="DMA Burst Mode Selection bit" mask="0x00000600" name="DMABRSTM" values="USBDMA3C__DMABRSTM" />
         </register>
         <register caption="USB DMA Channel 3 Memory Address Register" name="USBDMA3A" offset="0x228" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DMAADDR" />
         </register>
         <register caption="USB DMA Channel 3 Count Register" name="USBDMA3N" offset="0x22c" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DMACOUNT" />
         </register>
         <register caption="USB DMA Channel 4 Control Register" name="USBDMA4C" offset="0x234" rw="RW" size="4">
            <bitfield caption="DMA Enable bit" mask="0x00000001" name="DMAEN" values="USBDMA4C__DMAEN" />
            <bitfield caption="DMA Transfer Direction bit" mask="0x00000002" name="DMADIR" values="USBDMA4C__DMADIR" />
            <bitfield caption="DMA Transfer Mode bit" mask="0x00000004" name="DMAMODE" values="USBDMA4C__DMAMODE" />
            <bitfield caption="DMA Interrupt Enable bit" mask="0x00000008" name="DMAIE" values="USBDMA4C__DMAIE" />
            <bitfield mask="0x000000F0" name="DMAEP" />
            <bitfield caption="Bus Error bit" mask="0x00000100" name="DMAERR" values="USBDMA4C__DMAERR" />
            <bitfield caption="DMA Burst Mode Selection bit" mask="0x00000600" name="DMABRSTM" values="USBDMA4C__DMABRSTM" />
         </register>
         <register caption="USB DMA Channel 4 Memory Address Register" name="USBDMA4A" offset="0x238" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DMAADDR" />
         </register>
         <register caption="USB DMA Channel 4 Count Register" name="USBDMA4N" offset="0x23c" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DMACOUNT" />
         </register>
         <register caption="USB DMA Channel 5 Control Register" name="USBDMA5C" offset="0x244" rw="RW" size="4">
            <bitfield caption="DMA Enable bit" mask="0x00000001" name="DMAEN" values="USBDMA5C__DMAEN" />
            <bitfield caption="DMA Transfer Direction bit" mask="0x00000002" name="DMADIR" values="USBDMA5C__DMADIR" />
            <bitfield caption="DMA Transfer Mode bit" mask="0x00000004" name="DMAMODE" values="USBDMA5C__DMAMODE" />
            <bitfield caption="DMA Interrupt Enable bit" mask="0x00000008" name="DMAIE" values="USBDMA5C__DMAIE" />
            <bitfield mask="0x000000F0" name="DMAEP" />
            <bitfield caption="Bus Error bit" mask="0x00000100" name="DMAERR" values="USBDMA5C__DMAERR" />
            <bitfield caption="DMA Burst Mode Selection bit" mask="0x00000600" name="DMABRSTM" values="USBDMA5C__DMABRSTM" />
         </register>
         <register caption="USB DMA Channel 5 Memory Address Register" name="USBDMA5A" offset="0x248" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DMAADDR" />
         </register>
         <register caption="USB DMA Channel 5 Count Register" name="USBDMA5N" offset="0x24c" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DMACOUNT" />
         </register>
         <register caption="USB DMA Channel 6 Control Register" name="USBDMA6C" offset="0x254" rw="RW" size="4">
            <bitfield caption="DMA Enable bit" mask="0x00000001" name="DMAEN" values="USBDMA6C__DMAEN" />
            <bitfield caption="DMA Transfer Direction bit" mask="0x00000002" name="DMADIR" values="USBDMA6C__DMADIR" />
            <bitfield caption="DMA Transfer Mode bit" mask="0x00000004" name="DMAMODE" values="USBDMA6C__DMAMODE" />
            <bitfield caption="DMA Interrupt Enable bit" mask="0x00000008" name="DMAIE" values="USBDMA6C__DMAIE" />
            <bitfield mask="0x000000F0" name="DMAEP" />
            <bitfield caption="Bus Error bit" mask="0x00000100" name="DMAERR" values="USBDMA6C__DMAERR" />
            <bitfield caption="DMA Burst Mode Selection bit" mask="0x00000600" name="DMABRSTM" values="USBDMA6C__DMABRSTM" />
         </register>
         <register caption="USB DMA Channel 6 Memory Address Register" name="USBDMA6A" offset="0x258" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DMAADDR" />
         </register>
         <register caption="USB DMA Channel 6 Count Register" name="USBDMA6N" offset="0x25c" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DMACOUNT" />
         </register>
         <register caption="USB DMA Channel 7 Control Register" name="USBDMA7C" offset="0x264" rw="RW" size="4">
            <bitfield caption="DMA Enable bit" mask="0x00000001" name="DMAEN" values="USBDMA7C__DMAEN" />
            <bitfield caption="DMA Transfer Direction bit" mask="0x00000002" name="DMADIR" values="USBDMA7C__DMADIR" />
            <bitfield caption="DMA Transfer Mode bit" mask="0x00000004" name="DMAMODE" values="USBDMA7C__DMAMODE" />
            <bitfield caption="DMA Interrupt Enable bit" mask="0x00000008" name="DMAIE" values="USBDMA7C__DMAIE" />
            <bitfield mask="0x000000F0" name="DMAEP" />
            <bitfield caption="Bus Error bit" mask="0x00000100" name="DMAERR" values="USBDMA7C__DMAERR" />
            <bitfield caption="DMA Burst Mode Selection bit" mask="0x00000600" name="DMABRSTM" values="USBDMA7C__DMABRSTM" />
         </register>
         <register caption="USB DMA Channel 7 Memory Address Register" name="USBDMA7A" offset="0x268" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DMAADDR" />
         </register>
         <register caption="USB DMA Channel 7 Count Register" name="USBDMA7N" offset="0x26c" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DMACOUNT" />
         </register>
         <register caption="USB DMA Channel 8 Control Register" name="USBDMA8C" offset="0x274" rw="RW" size="4">
            <bitfield caption="DMA Enable bit" mask="0x00000001" name="DMAEN" values="USBDMA8C__DMAEN" />
            <bitfield caption="DMA Transfer Direction bit" mask="0x00000002" name="DMADIR" values="USBDMA8C__DMADIR" />
            <bitfield caption="DMA Transfer Mode bit" mask="0x00000004" name="DMAMODE" values="USBDMA8C__DMAMODE" />
            <bitfield caption="DMA Interrupt Enable bit" mask="0x00000008" name="DMAIE" values="USBDMA8C__DMAIE" />
            <bitfield mask="0x000000F0" name="DMAEP" />
            <bitfield caption="Bus Error bit" mask="0x00000100" name="DMAERR" values="USBDMA8C__DMAERR" />
            <bitfield caption="DMA Burst Mode Selection bit" mask="0x00000600" name="DMABRSTM" values="USBDMA8C__DMABRSTM" />
         </register>
